"""
Задача 05-03. Максимум и минимум

Прочитайте числа через пробел (гарантируется хотя бы одно) и выведите
две строки:

    Максимум: <наибольшее число>
    Минимум: <наименьшее число>

Функции max/min не использовать. За начальное значение берите первый
элемент списка.

Пример
------
Ввод:
3 -7 10 4
Вывод:
Максимум: 10
Минимум: -7
"""


numbers = input().split()
max_num = int(numbers[0])
min_num = int(numbers[0])
for num in numbers:
    num = int(num)
    if num > max_num:
        max_num = num
    if num < min_num:
        min_num = num
print(f"Максимум: {max_num}")
print(f"Минимум: {min_num}")
