"""
Задача 08. Знакомство (f-строки)

Прочитайте имя студента и его возраст в годах (целое число).
Считайте, что сейчас 2026 год. Выведите две строки:

    Имя: <имя>, возраст: <возраст>
    Год рождения: <2026 минус возраст>

Строки с подстановкой значений стройте с помощью f-строк.

Пример
------
Ввод:
Аня
19
Вывод:
Имя: Аня, возраст: 19
Год рождения: 2007

Подсказка
---------
print(f"Имя: {name}, возраст: {age}")
"""

name = input()
age = int(input())  

print(f"Имя: {name}, возраст: {age}")
print(f"Год рождения: {2026 - age}")
