"""
Задача 04-12. Проверка e-mail

Прочитайте строку — предполагаемый адрес e-mail — и выведите True,
если она похожа на корректный адрес по правилам ниже, иначе False:

1. символ «@» встречается ровно один раз;
2. «@» стоит не в начале и не в конце строки;
3. после «@» есть хотя бы одна точка.

Пример
------
Ввод:
ivan@mail.ru
Вывод:
True
"""

email = input()
is_valid = (
    email.count("@") == 1 and
    email.find("@") != 0 and
    email.find("@") != len(email) - 1 and
    email.find(".", email.find("@")) != -1
)
print(is_valid)

